online_benchmark_log/unknown/DeepSeek-R1-MXFP4-Preview/v0.5.4.post1-rocm700-mi35x-20251030_DeepSeek-R1-MXFP4-Preview_FP8_online_mtp_test/sglang_serving_benchmark_concurrency_16_run1_20251030_183913.log
Run started at: 2025-10-30 18:39:13 PDT
Using 128 prompts for concurrency 16
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model=None, tokenizer=None, num_prompts=128, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=3200, random_output_len=800, random_range_ratio=1.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='/mnt/raid/models/deepseek-ai/amd-DeepSeek-R1-MXFP4-Preview', tokenizer=None, num_prompts=128, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=3200, random_output_len=800, random_range_ratio=1.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 409600
#Output tokens: 102400
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 128/128 [04:53<00:00,  2.29s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 16        
Successful requests:                     128       
Benchmark duration (s):                  293.15    
Total input tokens:                      409600    
Total input text tokens:                 409600    
Total input vision tokens:               0         
Total generated tokens:                  102400    
Total generated tokens (retokenized):    102046    
Request throughput (req/s):              0.44      
Input token throughput (tok/s):          1397.22   
Output token throughput (tok/s):         349.31    
Total token throughput (tok/s):          1746.53   
Concurrency:                             16.00     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   36634.75  
Median E2E Latency (ms):                 36533.90  
---------------Time to First Token----------------
Mean TTFT (ms):                          403.31    
Median TTFT (ms):                        338.65    
P99 TTFT (ms):                           658.05    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           45.35     
Median ITL (ms):                         40.40     
P95 ITL (ms):                            65.15     
P99 ITL (ms):                            143.23    
Max ITL (ms):                            655.01    
==================================================
Run completed at: 2025-10-30 18:44:16 PDT
Run duration: 303 seconds